#-*- coding: utf-8 -*-
#!/usr/bin/env python3

tt = """Ð¢Ñ\x80Ð¸ Ð´ÐµÐ²Ð¸Ñ\x86Ñ\x8b Ð¿Ð¾Ð´ Ð¾ÐºÐ½Ð¾Ð¼
Ð\x9fÑ\x80Ñ\x8fÐ»Ð¸ Ð¿Ð¾Ð·Ð´Ð½Ð¾ Ð²ÐµÑ\x87ÐµÑ\x80ÐºÐ¾Ð¼.
"Ð\x9aÐ°Ð±Ñ\x8b Ñ\x8f Ð±Ñ\x8bÐ»Ð° Ñ\x86Ð°Ñ\x80Ð¸Ñ\x86Ð°,-
Ð\x93Ð¾Ð²Ð¾Ñ\x80Ð¸Ñ\x82 Ð¾Ð´Ð½Ð° Ð´ÐµÐ²Ð¸Ñ\x86Ð°,-
Ð¢Ð¾ Ð½Ð° Ð²ÐµÑ\x81Ñ\x8c ÐºÑ\x80ÐµÑ\x89ÐµÐ½Ñ\x8bÐ¹ Ð¼Ð¸Ñ\x80
Ð\x9fÑ\x80Ð¸Ð³Ð¾Ñ\x82Ð¾Ð²Ð¸Ð»Ð° Ð± Ñ\x8f Ð¿Ð¸Ñ\x80".
- "Ð\x9aÐ°Ð±Ñ\x8b Ñ\x8f Ð±Ñ\x8bÐ»Ð° Ñ\x86Ð°Ñ\x80Ð¸Ñ\x86Ð°,-
Ð\x93Ð¾Ð²Ð¾Ñ\x80Ð¸Ñ\x82 ÐµÐµ Ñ\x81ÐµÑ\x81Ñ\x82Ñ\x80Ð¸Ñ\x86Ð°,-
Ð¢Ð¾ Ð½Ð° Ð²ÐµÑ\x81Ñ\x8c Ð±Ñ\x8b Ð¼Ð¸Ñ\x80 Ð¾Ð´Ð½Ð°
Ð\x9dÐ°Ñ\x82ÐºÐ°Ð»Ð° Ñ\x8f Ð¿Ð¾Ð»Ð¾Ñ\x82Ð½Ð°".
- "Ð\x9aÐ°Ð±Ñ\x8b Ñ\x8f Ð±Ñ\x8bÐ»Ð° Ñ\x86Ð°Ñ\x80Ð¸Ñ\x86Ð°,-
Ð¢Ñ\x80ÐµÑ\x82Ñ\x8cÑ\x8f Ð¼Ð¾Ð»Ð²Ð¸Ð»Ð° Ñ\x81ÐµÑ\x81Ñ\x82Ñ\x80Ð¸Ñ\x86Ð°,-
Ð¯ Ð± Ð´Ð»Ñ\x8f Ð±Ð°Ñ\x82Ñ\x8eÑ\x88ÐºÐ¸-Ñ\x86Ð°Ñ\x80Ñ\x8f
Ð\xa0Ð¾Ð´Ð¸Ð»Ð°"""

cc = "latin-1"

file = open("_" + cc + ".txt", "w", encoding=cc)
file.write(tt)
file.close()
